Обработки/Reports/_ФормаП6.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ФормаП6</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ФормаП6/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Форма П-6. Сведения о финансовых вложениях и показателях",
		"0.12",
		"",
		Истина);
		                                                                                             
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");

	Возврат Настройки;

КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.Подписант = НастройкиОтчета.Подписант.КонтактноеЛицо;
		
	ДокументТитул	= Новый ТабличныйДокумент;
	ДокументРаздел1	= Новый ТабличныйДокумент;
	ДокументРаздел2	= Новый ТабличныйДокумент;
	ДокументРаздел3	= Новый ТабличныйДокумент;
	Расшифровка	= Новый ТабличныйДокумент;
	
	Сформировать(ДокументТитул, ДокументРаздел1, ДокументРаздел2, ДокументРаздел3, Расшифровка);
		
	КнигаЭксель = Новый ПакетОтображаемыхДокументов;
	
	Элемент1 = КнигаЭксель.Состав.Добавить(ПоместитьВоВременноеХранилище(ДокументТитул, Новый УникальныйИдентификатор));		
	Элемент1.Наименование = "Титул";
		
	Элемент2 = КнигаЭксель.Состав.Добавить(ПоместитьВоВременноеХранилище(ДокументРаздел1, Новый УникальныйИдентификатор));
	Элемент2.Наименование = "Раздел1";
		
	Элемент3 = КнигаЭксель.Состав.Добавить(ПоместитьВоВременноеХранилище(ДокументРаздел2, Новый УникальныйИдентификатор));
	Элемент3.Наименование = "Раздел2";		
		
	Элемент4 = КнигаЭксель.Состав.Добавить(ПоместитьВоВременноеХранилище(ДокументРаздел3, Новый УникальныйИдентификатор));
	Элемент4.Наименование = "Раздел3";		
		
	Элемент5 = КнигаЭксель.Состав.Добавить(ПоместитьВоВременноеХранилище(Расшифровка, Новый УникальныйИдентификатор));
	Элемент5.Наименование = "Расшифровка";			
	
	НастройкиОтчета.Вставить("Результат", КнигаЭксель);
		
КонецПроцедуры

Процедура ЗаполнитьТитульныйЛист(ДокументТитул)
	
	Макет = ПолучитьМакет("МакетТитульнаяСтраница");
	ОбластьТС = Макет.ПолучитьОбласть("ОбластьТС");
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
	|ПОМЕСТИТЬ _КлиентДоверительногоУправления
	|ИЗ
	|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыЮридическихЛицКлиента.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу,
	|	РеквизитыЮридическихЛицКлиента.ЮридическийАдрес КАК ЮридическийАдрес
	|ИЗ
	|	_КлиентДоверительногоУправления КАК _КлиентДоверительногоУправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(, ) КАК РеквизитыЮридическихЛицКлиента
	|		ПО _КлиентДоверительногоУправления.Клиент = РеквизитыЮридическихЛицКлиента.ЮрФизЛицо
	|			И (РеквизитыЮридическихЛицКлиента.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))" ;
	
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(ОбластьТС.Параметры, Выборка);			
	КонецЕсли;	
	
	ОбластьТС.Параметры.Год = Год(ЭтотОбъект.Период.ДатаОкончания) - 2000;
	ОбластьТС.Параметры.Месяц = Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=ММММ");
	ОбластьТС.Параметры.Приказ = "от 27.08.2014 № 535";
	
	ДокументТитул.Вывести(ОбластьТС);
	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументТитул, "ФормаП6.Титул", , ОриентацияСтраницы.Портрет);		
	
	
КонецПроцедуры

Функция ОпеределитьСрочность(ДатаМинор, ДатаМажор)
	
	Если ДобавитьМесяц(ДатаМинор, 12) <= ДатаМажор Тогда 
		Срочность = "Д";
	Иначе
		Срочность = "К";
	КонецЕсли;						
			
	Возврат Срочность;		
	
КонецФункции	

Функция ПолучитьСтатусДолгосрочнаяКраткосрочная(ЦеннаяБумага, Рынок, Настройка, ДатаСтатуса, ДатаПокупки, ДатаПогашения) Экспорт
	
	Если ТипЗнч(ЦеннаяБумага)=Тип("СправочникСсылка.ДепозитныеВклады") Тогда
		ВидАктиваЦБ = Справочники.УчетныеАктивы.ДепозитныеВклады;
	Иначе	
		ВидАктиваЦБ = БухгалтерскийУчет.ОпределитьУчетныйАктив(ДатаСтатуса, Рынок, ЦеннаяБумага);
	КонецЕсли;	
			
		//теперь как классификация по сроку
		СтрокаНастройка = Настройка.Найти(ВидАктиваЦБ, "УчетныйАктив");
		Если СтрокаНастройка<>Неопределено Тогда
			КлассификаторСрочностиЦБ = СтрокаНастройка.КлассификацияАктиваПоСрочности;
		КонецЕсли;	
				
		//определяем вид
		Если КлассификаторСрочностиЦБ = Справочники.КлассификаторАктивовПоСрочности.ПустаяСсылка()
			ИЛИ КлассификаторСрочностиЦБ = Справочники.КлассификаторАктивовПоСрочности.ВсегдаКраткосрочные Тогда 
			ДелениеПоСрокуЦБ = "К";
		ИначеЕсли КлассификаторСрочностиЦБ = Справочники.КлассификаторАктивовПоСрочности.ВсегдаДолгосрочные Тогда
			ДелениеПоСрокуЦБ = "Д";
		ИначеЕсли КлассификаторСрочностиЦБ = Справочники.КлассификаторАктивовПоСрочности.ОтОтчетнойДоПогашения Тогда
			ДелениеПоСрокуЦБ = ОпеределитьСрочность(ДатаСтатуса, ДатаПогашения);
		ИначеЕсли КлассификаторСрочностиЦБ = Справочники.КлассификаторАктивовПоСрочности.ОтПокупкиДоПогашения	Тогда
			ДелениеПоСрокуЦБ = ОпеределитьСрочность(ДатаПокупки, ДатаПогашения); 
		ИначеЕсли КлассификаторСрочностиЦБ = Справочники.КлассификаторАктивовПоСрочности.ОтПокупкиДоОтчетной Тогда
			ДелениеПоСрокуЦБ = ОпеределитьСрочность(ДатаПокупки, ДатаСтатуса); 
		КонецЕсли;		
			
	Возврат ДелениеПоСрокуЦБ;	
		
КонецФункции	

Процедура ВнестиЗначениеВЯчейку(Область, Адрес, Значение)
	
	Ячейка = Область.Области.Найти(Адрес);
	Ячейка.Значение = Ячейка.Значение + Значение;
	
КонецПроцедуры	

Процедура ЗаполнитьСтроку(Область, СтрокаН, СтрокаК, СтрокаРезультат, Раздел);

	Если Раздел = 1 Тогда 
		ЧислоКолонок = 7;
	ИначеЕсли Раздел = 2 Тогда 
		ЧислоКолонок = 6;
	ИначеЕсли Раздел = 3 Тогда 
		ЧислоКолонок = 2;
	КонецЕсли;	
	
	Если СтрокаН = СтрокаК Тогда
		Для инд = 1 по ЧислоКолонок Цикл 
			Адрес = "П"+СтрокаН+ "0" + инд; 
			ВнестиЗначениеВЯчейку(Область, Адрес,СтрокаРезультат["_0"+инд]); 
		КонецЦикла;
	Иначе		
		Если Раздел <> 1 Тогда     //переход кратко/долгосрочка делим только в 1-м разделе
			Возврат
		КонецЕсли;	
		// в СтрокаН оставляем только начальный остаток 01
		ВнестиЗначениеВЯчейку(ОБласть, "П"+СтрокаН+ "01",СтрокаРезультат["_01"]);
		// нач остаток вставим в расход . перешло в другую срочностть
		ВнестиЗначениеВЯчейку(ОБласть, "П"+СтрокаН+ "03",СтрокаРезультат["_01"]);
		// Приход = Приход + НачОстаток, 01+02, как приход по другой срочности. 		
		ВнестиЗначениеВЯчейку(Область, "П"+СтрокаК+ "02",СтрокаРезультат["_01"]);
		ВнестиЗначениеВЯчейку(Область, "П"+СтрокаК+ "02",СтрокаРезультат["_02"]);		
		//// Расход = Расход + НачОстаток 01+03
		//ВнестиЗначениеВЯчейку(Область, "П"+СтрокаК+ "03",СтрокаРезультат["_01"]);
		//ВнестиЗначениеВЯчейку(Область, "П"+СтрокаК+ "03",СтрокаРезультат["_03"]);
	
		
		Для инд = 3 по ЧислоКолонок Цикл 
			Адрес = "П"+СтрокаК+ "0" + инд; 
			ВнестиЗначениеВЯчейку(Область, Адрес,СтрокаРезультат["_0"+инд]); 
		КонецЦикла;
		
		// произошел переход из раздела в раздел. НачОстаток прокрутим через приход и расход
		// эти значения будут распередяться по видам деятельности
		КорректировкаПриход =  СтрокаРезультат["_01"] + СтрокаРезультат["_02"];
		КорректировкаРасход =  СтрокаРезультат["_01"] + СтрокаРезультат["_03"];
		
		СтрокаРезультат["_02"] = КорректировкаПриход;
		СтрокаРезультат["_03"] = КорректировкаРасход;
			
		//СтрокаРезультат["_02"] = СтрокаРезультат["_02"] + СтрокаРезультат["_01"];
		//СтрокаРезультат["_03"] = СтрокаРезультат["_03"] + СтрокаРезультат["_01"];
				
	КонецЕсли;	
	
КонецПроцедуры 	

Процедура СуммированиеСтрок(ИтоговаяСтрока, МассивСтрок, Область, Раздел)
	
	Если Раздел = 1 Тогда 
		ЧислоКолонок = 7;
	ИначеЕсли Раздел = 2 Тогда 
		ЧислоКолонок = 6;
	ИначеЕсли Раздел = 3 Тогда 
		ЧислоКолонок = 2;
	КонецЕсли;		
	
	Для Каждого СтрокаИсточник из МассивСтрок Цикл 
		Для инд=1 по ЧислоКолонок Цикл 
			АдресКуда = "П" + ИтоговаяСтрока + "0" + инд;
			АдресОткуда = "П" + СтрокаИсточник + "0" + инд;
			Значение = Область.Области.Найти(АдресОткуда).Значение;
			ВнестиЗначениеВЯчейку(Область, АдресКуда, Значение);
		КонецЦикла;	
	КонецЦикла;	

КонецПроцедуры 	
	
Процедура РасчетИтоговРаздел1(Область)
	
	//акции к/д
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("050");
	МассивСтрок.Добавить("060");	
	СуммированиеСтрок("040", МассивСтрок, Область, 1);
	
	//облигации к/д
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("150");
	МассивСтрок.Добавить("160");	
	СуммированиеСтрок("140", МассивСтрок, Область, 1);
	
	//депозиты к/д
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("326");
	МассивСтрок.Добавить("328");	
	СуммированиеСтрок("325", МассивСтрок, Область, 1);
	
	//прочие
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("340");
	МассивСтрок.Добавить("350");	
	СуммированиеСтрок("330", МассивСтрок, Область, 1);
	
	
	//долгосрочные
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("050");
	МассивСтрок.Добавить("150");
	МассивСтрок.Добавить("328");
	МассивСтрок.Добавить("340");
	СуммированиеСтрок("020", МассивСтрок, Область, 1);
	
	//краткосрочные
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("060");
	МассивСтрок.Добавить("160");
	МассивСтрок.Добавить("326");
	МассивСтрок.Добавить("350");
	СуммированиеСтрок("030", МассивСтрок, Область, 1);
	
	//общий итог
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("020");
	МассивСтрок.Добавить("030");
	СуммированиеСтрок("010", МассивСтрок, Область, 1);
	
	 //по видам деятельности   акции
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("090");
	МассивСтрок.Добавить("100");
	МассивСтрок.Добавить("110");
	МассивСтрок.Добавить("120");
	МассивСтрок.Добавить("130");
	СуммированиеСтрок("080", МассивСтрок, Область, 1);
 
	//					облигации 
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("190");
	МассивСтрок.Добавить("200");
	МассивСтрок.Добавить("210");
	МассивСтрок.Добавить("220");
	МассивСтрок.Добавить("230");
	МассивСтрок.Добавить("240");
	МассивСтрок.Добавить("245");
	СуммированиеСтрок("180", МассивСтрок, Область, 1);
	
	// 			прочие
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("380");
	МассивСтрок.Добавить("390");
	МассивСтрок.Добавить("400");
	МассивСтрок.Добавить("410");
	МассивСтрок.Добавить("420");
	МассивСтрок.Добавить("435");
	СуммированиеСтрок("370", МассивСтрок, Область, 1);
	
	
КонецПроцедуры	

Процедура РасчетИтоговРаздел2(Область)
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("570");
	МассивСтрок.Добавить("580");
	МассивСтрок.Добавить("585");
	МассивСтрок.Добавить("590");
	СуммированиеСтрок("560", МассивСтрок, Область, 2);
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("550");
	МассивСтрок.Добавить("560");
	СуммированиеСтрок("540", МассивСтрок, Область, 2);
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("510");
	МассивСтрок.Добавить("530");
	МассивСтрок.Добавить("540");
	МассивСтрок.Добавить("600");    // ? не уверен, но так в 7-ке. Строка все равно не заполняется
	СуммированиеСтрок("500", МассивСтрок, Область, 2);
	
КонецПроцедуры

Процедура ДобавитьВРасшифровку(ДокументРасшифровка, ОбластьСтрока, СтрокаРезультат, СтатусНачало, СтатусКонец, СтрокаН, СтрокаК, СтрокаВД, СтрокаНеРезидент);	

	СтрокаОтчета = "";
	Если СтрокаН = СтрокаК Тогда 
		СтрокаОтчета = СтрокаН;
	Иначе	
		СтрокаОтчета = СтрокаН + "->"+ СтрокаК;
	КонецЕсли;	
	Если Не ПустаяСтрока(СтрокаВД) Тогда 
		СтрокаОтчета = СтрокаОтчета + ", " + СтрокаВД;
	КонецЕсли;	
	Если Не ПустаяСтрока(СтрокаНеРезидент) Тогда 
		СтрокаОтчета = СтрокаОтчета + ", " + СтрокаНеРезидент;
	КонецЕсли;	
	
	ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаРезультат);	
	ОбластьСтрока.Параметры.СтатусНачало = СтатусНачало;
	ОбластьСтрока.Параметры.СтатусКонец = СтатусКонец;
	ОбластьСтрока.Параметры.СтрокаОтчета = СтрокаОтчета;
	ДокументРасшифровка.Вывести(ОбластьСтрока);
	
КонецПроцедуры

Функция ВернутьКодВидаДеятельности(Отрасль)
	
	Код = 1; //Прочие
	
	СтрокаОтрасль = СокрЛП(Отрасль.Наименование);
	Если СтрокаОтрасль = "Банки" Тогда 
		Код = 2;
	ИначеЕсли СтрокаОтрасль = "Финансовые компании" Тогда
		Код = 5;
	КонецЕсли;
	
	Возврат Код;
	
КонецФункции

Процедура ЗаполнитьРаздел1(ДокументРаздел1, ДокументРасшифровка)
	
	//настройки долгосрочности /краткосрочности
	// смотрю на конец периода. В течение года настройки не меняются.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиУчетаАктивовСрезПоследних.УчетныйАктив КАК УчетныйАктив,
	|	НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности КАК КлассификацияАктиваПоСрочности
	|ИЗ
	|	РегистрСведений.НастройкиУчетаАктивов.СрезПоследних(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.БухгалтерскийУчет)) КАК НастройкиУчетаАктивовСрезПоследних" ;
	
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.Период.ДатаОкончания);
	
	НастройкиДК = Запрос.Выполнить().Выгрузить();
	
	Макет = ПолучитьМакет("МакетРаздел1");
	ОбластьРаздел = Макет.ПолучитьОбласть("Раздел1");
	
	Расшифровка = ПолучитьМакет("Расшифровка");
	ОбластьШапка = Расшифровка.ПолучитьОбласть("Шапка");
	ДокументРасшифровка.Вывести(ОбластьШапка);
	
	ОбластьСтрока = Расшифровка.ПолучитьОбласть("Стр");

	//Так как клиент только Росинфоком, то есть возможность упростить отчет
	// Срочность облигаций и депозитов от отчетной даты до даты погашение, партии не нужны
	// срочность купона по телу, не нужно анализировать купонные периоды
	// акции всегда долгосрочные
	// активы берем с баланса 
	//		1) Определяем срочность на начало и конец
	//		2) Определяем вид деятельности эмитента
	//		3) Распределяем
	//
	
	Запрос = Новый Запрос;
#Область ТестЗапроса	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&АналитикиРЕПО)
	|			ТОГДА ""РЕПО""
	|		КОГДА БухгалтерскийУчетОбороты.Субконто2 ССЫЛКА Документ.МНО
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ БухгалтерскийУчетОбороты.Субконто2
	|	КОНЕЦ КАК Субконто2,
	|	БухгалтерскийУчетОбороты.СуммаОборотКт КАК Сумма
	|ПОМЕСТИТЬ _ДоходыРасходы
	|ИЗ
	|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы),
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
	|			,
	|			) КАК БухгалтерскийУчетОбороты
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА БухгалтерскийУчетОбороты.Субконто1 В (&АналитикиРЕПО)
	|			ТОГДА ""РЕПО""
	|		КОГДА БухгалтерскийУчетОбороты.Субконто2 ССЫЛКА Документ.МНО
	|			ТОГДА ВЫРАЗИТЬ(БухгалтерскийУчетОбороты.Субконто2 КАК Документ.МНО).РасчетныйСчет
	|		ИНАЧЕ БухгалтерскийУчетОбороты.Субконто2
	|	КОНЕЦ,
	|	-БухгалтерскийУчетОбороты.СуммаОборотДт
	|ИЗ
	|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасходы),
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
	|			,
	|			) КАК БухгалтерскийУчетОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ДоходыРасходы.Субконто2 КАК Субконто2,
	|	СУММА(_ДоходыРасходы.Сумма) КАК Сумма
	|ПОМЕСТИТЬ _Доходность
	|ИЗ
	|	_ДоходыРасходы КАК _ДоходыРасходы
	|
	|СГРУППИРОВАТЬ ПО
	|	_ДоходыРасходы.Субконто2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПредоставленныеЗаймы)
	|				ИЛИ БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.НалоговыеНачисленияПоРЕПО)
	|			ТОГДА БухгалтерскийУчетОстаткиИОбороты.Субконто2.Контрагент
	|		ИНАЧЕ БухгалтерскийУчетОстаткиИОбороты.Субконто1
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПредоставленныеЗаймы)
	|				ИЛИ БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.НалоговыеНачисленияПоРЕПО)
	|			ТОГДА ""РЕПО""
	|		ИНАЧЕ БухгалтерскийУчетОстаткиИОбороты.Субконто1
	|	КОНЕЦ КАК Актив,
	|	ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОстаткиИОбороты.Субконто1) КАК Тип,
	|	СУММА(БухгалтерскийУчетОстаткиИОбороты.КоличествоНачальныйОстаток + БухгалтерскийУчетОстаткиИОбороты.КоличествоОборотДт) КАК Количество,
	|	СУММА(БухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток) КАК СуммаНачальныйОстаток,
	|	СУММА(БухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток
	|ПОМЕСТИТЬ _ОстанкиНачКон
	|ИЗ
	|	РегистрБухгалтерии.БухгалтерскийУчет.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.ФинансовыеВложения), ЗНАЧЕНИЕ(ПланСчетов.Основной.ДепозитныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Основной.ВалютныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Основной.РезервыПодОбесценениеФинансовыхВложений), ЗНАЧЕНИЕ(ПланСчетов.Основной.НалоговыеНачисленияПоРЕПО))
	|				И НЕ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.ЦенныеБумагиВЗалоге)),
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПредоставленныеЗаймы)
	|				ИЛИ БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.НалоговыеНачисленияПоРЕПО)
	|			ТОГДА БухгалтерскийУчетОстаткиИОбороты.Субконто2.Контрагент
	|		ИНАЧЕ БухгалтерскийУчетОстаткиИОбороты.Субконто1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПредоставленныеЗаймы)
	|				ИЛИ БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.НалоговыеНачисленияПоРЕПО)
	|			ТОГДА ""РЕПО""
	|		ИНАЧЕ БухгалтерскийУчетОстаткиИОбороты.Субконто1
	|	КОНЕЦ,
	|	ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОстаткиИОбороты.Субконто1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БухгалтерскийУчетОстаткиИОбороты.Счет КАК Счет,
	|	ВЫБОР
	|		КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПредоставленныеЗаймы)
	|				ИЛИ БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.НалоговыеНачисленияПоРЕПО)
	|			ТОГДА БухгалтерскийУчетОстаткиИОбороты.Субконто2.Контрагент
	|		ИНАЧЕ БухгалтерскийУчетОстаткиИОбороты.Субконто1
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОстаткиИОбороты.Регистратор) = ТИП(Документ.ВводЦенныхБумаг)
	|				ИЛИ ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОстаткиИОбороты.Регистратор) = ТИП(Документ.ВыводЦенныхБумаг)
	|			ТОГДА БухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт - БухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт
	|		КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.РезервыПодОбесценениеФинансовыхВложений))
	|			ТОГДА БухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт - БухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Иное,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОстаткиИОбороты.Регистратор) = ТИП(Документ.ПереоценкаЦенныхБумаг)
	|			ТОГДА БухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт - БухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Переоценка,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОстаткиИОбороты.Регистратор) = ТИП(Документ.ПогашениеЦеннойБумаги)
	|				И БухгалтерскийУчетОстаткиИОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаФинансовыхВложений))
	|			ТОГДА 0
	|		КОГДА ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОстаткиИОбороты.Регистратор) = ТИП(Документ.ВводЦенныхБумаг)
	|			ТОГДА 0
	|		КОГДА ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОстаткиИОбороты.Регистратор) <> ТИП(Документ.ПереоценкаЦенныхБумаг)
	|			ТОГДА БухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приход,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОстаткиИОбороты.Регистратор) = ТИП(Документ.ПогашениеЦеннойБумаги)
	|				И БухгалтерскийУчетОстаткиИОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаФинансовыхВложений))
	|			ТОГДА БухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт - БухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт
	|		КОГДА ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОстаткиИОбороты.Регистратор) = ТИП(Документ.ВыводЦенныхБумаг)
	|			ТОГДА 0
	|		КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.РезервыПодОбесценениеФинансовыхВложений))
	|			ТОГДА 0
	|		КОГДА ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОстаткиИОбороты.Регистратор) <> ТИП(Документ.ПереоценкаЦенныхБумаг)
	|			ТОГДА БухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Расход,
	|	БухгалтерскийУчетОстаткиИОбороты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ _ЦБ_движения
	|ИЗ
	|	РегистрБухгалтерии.БухгалтерскийУчет.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.ФинансовыеВложения), ЗНАЧЕНИЕ(ПланСчетов.Основной.ДепозитныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Основной.ВалютныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Основной.РезервыПодОбесценениеФинансовыхВложений), ЗНАЧЕНИЕ(ПланСчетов.Основной.НалоговыеНачисленияПоРЕПО))
	|				И НЕ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.ЦенныеБумагиВЗалоге)),
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ЦБ_движения.Субконто1 КАК Субконто1,
	|	СУММА(_ЦБ_движения.Иное) КАК Иное,
	|	СУММА(_ЦБ_движения.Переоценка) КАК Переоценка,
	|	СУММА(_ЦБ_движения.Приход) КАК Приход,
	|	СУММА(_ЦБ_движения.Расход) КАК Расход
	|ПОМЕСТИТЬ _ДвиженияСвернуто
	|ИЗ
	|	_ЦБ_движения КАК _ЦБ_движения
	|
	|СГРУППИРОВАТЬ ПО
	|	_ЦБ_движения.Субконто1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ОстанкиНачКон.Субконто1 КАК Субконто1,
	|	_ОстанкиНачКон.Актив КАК Актив,
	|	_ОстанкиНачКон.Тип КАК Тип,
	|	ВЫБОР
	|		КОГДА _ОстанкиНачКон.Тип = ТИП(Справочник.Акции)
	|			ТОГДА ВЫРАЗИТЬ(_ОстанкиНачКон.Субконто1 КАК Справочник.Акции).Эмитент.ЮрФизЛицо
	|		КОГДА _ОстанкиНачКон.Тип = ТИП(Справочник.Облигации)
	|			ТОГДА ВЫРАЗИТЬ(_ОстанкиНачКон.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
	|		КОГДА _ОстанкиНачКон.Тип = ТИП(Справочник.БанковскиеСчета)
	|			ТОГДА ВЫРАЗИТЬ(_ОстанкиНачКон.Субконто1 КАК Справочник.БанковскиеСчета).Банк.ЮрФизЛицо
	|		КОГДА _ОстанкиНачКон.Тип = ТИП(Справочник.ДепозитныеВклады)
	|			ТОГДА ВЫРАЗИТЬ(_ОстанкиНачКон.Субконто1 КАК Справочник.ДепозитныеВклады).БанковскийСчет.Банк.ЮрФизЛицо
	|		КОГДА _ОстанкиНачКон.Тип = ТИП(Справочник.ЮрФизЛица)
	|			ТОГДА _ОстанкиНачКон.Субконто1
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЮрЛицо,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(_ОстанкиНачКон.Субконто1) = ТИП(Справочник.Облигации)
	|			ТОГДА ВЫРАЗИТЬ(_ОстанкиНачКон.Субконто1 КАК Справочник.Облигации).ДатаПогашения
	|		КОГДА ТИПЗНАЧЕНИЯ(_ОстанкиНачКон.Субконто1) = ТИП(Справочник.ДепозитныеВклады)
	|			ТОГДА УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК ДатаПогашения,
	|	_ОстанкиНачКон.Количество КАК Количество,
	|	_ОстанкиНачКон.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	_ОстанкиНачКон.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	_ДвиженияСвернуто.Приход КАК Приход,
	|	_ДвиженияСвернуто.Расход КАК Расход,
	|	_ДвиженияСвернуто.Переоценка КАК Переоценка,
	|	_ДвиженияСвернуто.Иное КАК Иное,
	|	ЕСТЬNULL(_Доходность.Сумма, 0) КАК Сумма
	|ПОМЕСТИТЬ _ИтоговаяТаблица
	|ИЗ
	|	_ОстанкиНачКон КАК _ОстанкиНачКон
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ДвиженияСвернуто КАК _ДвиженияСвернуто
	|		ПО _ОстанкиНачКон.Субконто1 = _ДвиженияСвернуто.Субконто1
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Доходность КАК _Доходность
	|		ПО _ОстанкиНачКон.Актив = _Доходность.Субконто2
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
	|			УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения,
	|			УсловияКредитныхИнструментовСрезПоследних.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
	|			УсловияКредитныхИнструментовСрезПоследних.Процент КАК Процент,
	|			УсловияКредитныхИнструментовСрезПоследних.Контрагент КАК Контрагент
	|		ИЗ
	|			(ВЫБРАТЬ
	|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
	|				МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
	|			ИЗ
	|				РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПериода, ДатаНачалаДействияУсловий <= &КонецПериода) КАК УсловияКредитныхИнструментовСрезПоследних
	|			ГДЕ
	|				УсловияКредитныхИнструментовСрезПоследних.Действует
	|			
	|			СГРУППИРОВАТЬ ПО
	|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент) КАК АктуальныеДатыНачалаДействия
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПериода, ДатаНачалаДействияУсловий <= &КонецПериода) КАК УсловияКредитныхИнструментовСрезПоследних
	|				ПО АктуальныеДатыНачалаДействия.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
	|					И АктуальныеДатыНачалаДействия.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК УсловияКредитныхИнструментовСрезПоследних
	|		ПО _ОстанкиНачКон.Субконто1 = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Банки.ЮрФизЛицо КАК ЮрФизЛицо
	|ПОМЕСТИТЬ _ЮрЛицаБанки
	|ИЗ
	|	Справочник.Банки КАК Банки
	|
	|СГРУППИРОВАТЬ ПО
	|	Банки.ЮрФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ИтоговаяТаблица.Субконто1 КАК Субконто1,
	|	_ИтоговаяТаблица.Актив КАК Актив,
	|	_ИтоговаяТаблица.Тип КАК Тип,
	|	_ИтоговаяТаблица.ЮрЛицо КАК ЮрЛицо,
	|	_ИтоговаяТаблица.Количество КАК Количество,
	|	_ИтоговаяТаблица.СуммаНачальныйОстаток КАК _01,
	|	_ИтоговаяТаблица.СуммаКонечныйОстаток КАК _06,
	|	_ИтоговаяТаблица.Приход КАК _02,
	|	_ИтоговаяТаблица.Расход КАК _03,
	|	_ИтоговаяТаблица.Переоценка КАК _04,
	|	_ИтоговаяТаблица.Иное КАК _05,
	|	_ИтоговаяТаблица.Сумма КАК _07,
	|	_ИтоговаяТаблица.ДатаПогашения КАК ДатаПогашения,
	|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ КАК РезидентРФ,
	|	ВЫБОР
	|		КОГДА НЕ _ЮрЛицаБанки.ЮрФизЛицо ЕСТЬ NULL
	|				И РеквизитыЮридическихЛицСрезПоследних.Отрасль <> &ОтрасльБанки
	|			ТОГДА &ОтрасльБанки
	|		ИНАЧЕ РеквизитыЮридическихЛицСрезПоследних.Отрасль
	|	КОНЕЦ КАК Отрасль
	|ИЗ
	|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&КонецПериода, Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
	|		ПО _ИтоговаяТаблица.ЮрЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ЮрЛицаБанки КАК _ЮрЛицаБанки
	|		ПО _ИтоговаяТаблица.ЮрЛицо = _ЮрЛицаБанки.ЮрФизЛицо";
#КонецОбласти	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("НачалоПериода", ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ОтрасльБанки", Справочники.Отрасли.НайтиПоНаименованию("Банки"));
	
	АналитикиРЕПО = Новый Массив;
	АналитикиРЕПО.Добавить(Справочники.ПрочиеДоходыИРасходы.НайтиПоНаименованию("Расходы по РЕПО"));
	АналитикиРЕПО.Добавить(Справочники.ПрочиеДоходыИРасходы.НайтиПоНаименованию("Проценты по РЕПО"));
	
	Запрос.УстановитьПараметр("АналитикиРЕПО", АналитикиРЕПО);
	
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	//распределение
	Для Каждого СтрокаРезультат из ТаблицаЗапроса Цикл 
		СтатусНачало = "";
		СтатусКонец = "";
		СтрокаН = "";
		СтрокаК = "";
		СтрокаВД = "";
		СтрокаНеРезидент= "";
		Если СтрокаРезультат.Тип = Тип("СправочникСсылка.Акции") Тогда
			СтатусНачало = ПолучитьСтатусДолгосрочнаяКраткосрочная(СтрокаРезультат.Субконто1, Перечисления.РынкиЦенныхБумаг.Акции, НастройкиДК, Период.ДатаНачала,"","");	
			СтатусКонец = ПолучитьСтатусДолгосрочнаяКраткосрочная(СтрокаРезультат.Субконто1, Перечисления.РынкиЦенныхБумаг.Акции, НастройкиДК, Период.ДатаОкончания, "", "");		
			Если СтатусНачало = "К" И СтатусКонец = "К" Тогда 
				СтрокаН = "060"; СтрокаК = "060";
			ИначеЕсли СтатусНачало = "К" И СтатусКонец = "Д" Тогда 
				СтрокаН = "060"; СтрокаК = "050";
			ИначеЕсли СтатусНачало = "Д" И СтатусКонец = "К" Тогда 
				СтрокаН = "050"; СтрокаК = "060";
			ИначеЕсли СтатусНачало = "Д" И СтатусКонец = "Д" Тогда 
				СтрокаН = "050"; СтрокаК = "050";
			КонецЕсли;				 
			
			
			КодВидадеятельности = ВернутьКодВидаДеятельности(СтрокаРезультат.Отрасль);
			Если КодВидадеятельности = 1 Тогда 
				СтрокаВД = "090"; 
			ИначеЕсли КодВидадеятельности = 2 Тогда 
				СтрокаВД = "100";
			ИначеЕсли КодВидадеятельности = 5 Тогда 
				СтрокаВД = "130";
			КонецЕсли;	
			
			Если НЕ СтрокаРезультат.РезидентРФ  Тогда 
				СтрокаНеРезидент = "070";
				СтрокаВД = "";
			КонецЕсли;	
			
		ИначеЕсли СтрокаРезультат.Тип = Тип("СправочникСсылка.Паи") Тогда
			СтатусНачало = ПолучитьСтатусДолгосрочнаяКраткосрочная(СтрокаРезультат.Субконто1, Перечисления.РынкиЦенныхБумаг.Паи, НастройкиДК, Период.ДатаНачала,"","");	
			СтатусКонец = ПолучитьСтатусДолгосрочнаяКраткосрочная(СтрокаРезультат.Субконто1, Перечисления.РынкиЦенныхБумаг.Паи, НастройкиДК, Период.ДатаОкончания, "", "");		
			Если СтатусНачало = "К" И СтатусКонец = "К" Тогда 
				СтрокаН = "060"; СтрокаК = "060";
			ИначеЕсли СтатусНачало = "К" И СтатусКонец = "Д" Тогда 
				СтрокаН = "060"; СтрокаК = "050";
			ИначеЕсли СтатусНачало = "Д" И СтатусКонец = "К" Тогда 
				СтрокаН = "050"; СтрокаК = "060";
			ИначеЕсли СтатусНачало = "Д" И СтатусКонец = "Д" Тогда 
				СтрокаН = "050"; СтрокаК = "050";
			КонецЕсли;				 			
			
			СтрокаВД = "110";
			
			Если НЕ СтрокаРезультат.РезидентРФ  Тогда 
				СтрокаНеРезидент = "070";
				СтрокаВД = "";
			КонецЕсли;	
			
		ИначеЕсли СтрокаРезультат.Тип = Тип("СправочникСсылка.Облигации") Тогда	
			СтатусНачало = ПолучитьСтатусДолгосрочнаяКраткосрочная(СтрокаРезультат.Субконто1, Перечисления.РынкиЦенныхБумаг.Облигации, НастройкиДК, Период.ДатаНачала,"",СтрокаРезультат.ДатаПогашения);	
			СтатусКонец = ПолучитьСтатусДолгосрочнаяКраткосрочная(СтрокаРезультат.Субконто1, Перечисления.РынкиЦенныхБумаг.Облигации, НастройкиДК, Период.ДатаОкончания, "", СтрокаРезультат.ДатаПогашения);			 	
			
			Если СтатусНачало = "К" И СтатусКонец = "К" Тогда 
				СтрокаН = "160"; СтрокаК = "160";
			ИначеЕсли СтатусНачало = "К" И СтатусКонец = "Д" Тогда 
				СтрокаН = "160"; СтрокаК = "150";
			ИначеЕсли СтатусНачало = "Д" И СтатусКонец = "К" Тогда 
				СтрокаН = "150"; СтрокаК = "160";
			ИначеЕсли СтатусНачало = "Д" И СтатусКонец = "Д" Тогда 
				СтрокаН = "150"; СтрокаК = "150";
			КонецЕсли;		
			
			КодВидадеятельности = ВернутьКодВидаДеятельности(СтрокаРезультат.Отрасль);
			Если КодВидадеятельности = 1 Тогда 
				СтрокаВД = "190"; 
			ИначеЕсли КодВидадеятельности = 2 Тогда 
				СтрокаВД = "200";
			ИначеЕсли КодВидадеятельности = 5 Тогда 
				СтрокаВД = "230";
			КонецЕсли;	
			
			Если СтрокаРезультат.Субконто1.УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства Тогда
				СтрокаВД = "240";
			КонецЕсли;	
					
			Если НЕ СтрокаРезультат.РезидентРФ  Тогда 
				СтрокаНеРезидент = "170";
				СтрокаВД = "";
			КонецЕсли;	
			
		ИначеЕсли СтрокаРезультат.Тип = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
			СтатусНачало = ПолучитьСтатусДолгосрочнаяКраткосрочная(СтрокаРезультат.Субконто1, , НастройкиДК, Период.ДатаНачала,"",СтрокаРезультат.ДатаПогашения);	
			СтатусКонец = ПолучитьСтатусДолгосрочнаяКраткосрочная(СтрокаРезультат.Субконто1, , НастройкиДК, Период.ДатаОкончания, "", СтрокаРезультат.ДатаПогашения);	
			
			СтатусНачало = ПолучитьСтатусДолгосрочнаяКраткосрочная(СтрокаРезультат.Субконто1, Перечисления.РынкиЦенныхБумаг.Облигации, НастройкиДК, Период.ДатаНачала,"",СтрокаРезультат.ДатаПогашения);	
			СтатусКонец = ПолучитьСтатусДолгосрочнаяКраткосрочная(СтрокаРезультат.Субконто1, Перечисления.РынкиЦенныхБумаг.Облигации, НастройкиДК, Период.ДатаОкончания, "", СтрокаРезультат.ДатаПогашения);			 	
			
			Если СтатусНачало = "К" И СтатусКонец = "К" Тогда 
				СтрокаН = "326"; СтрокаК = "326";
			ИначеЕсли СтатусНачало = "К" И СтатусКонец = "Д" Тогда 
				СтрокаН = "326"; СтрокаК = "328";
			ИначеЕсли СтатусНачало = "Д" И СтатусКонец = "К" Тогда 
				СтрокаН = "328"; СтрокаК = "326";
			ИначеЕсли СтатусНачало = "Д" И СтатусКонец = "Д" Тогда 
				СтрокаН = "328"; СтрокаК = "328";
			КонецЕсли;				 
			
			Если НЕ СтрокаРезультат.РезидентРФ  Тогда 
				Если СтрокаК = "326" Тогда 
					СтрокаНеРезидент = "327";
				ИначеЕсли СтрокаК = "328" Тогда 
					СтрокаНеРезидент = "329";
				КонецЕсли;	
				СтрокаВД = "";
			КонецЕсли;
			
		ИначеЕсли СтрокаРезультат.Тип = Тип("СправочникСсылка.БанковскиеСчета") Тогда
			СтрокаН = "450"; СтрокаК = "450";
		ИначеЕсли СтрокаРезультат.Тип = Тип("СправочникСсылка.ЮрФизЛица") И СтрокаРезультат.Актив = "РЕПО" Тогда	
			СтрокаН = "350"; СтрокаК = "350";
			
			КодВидадеятельности = ВернутьКодВидаДеятельности(СтрокаРезультат.Отрасль);
			Если КодВидадеятельности = 1 Тогда 
				СтрокаВД = "380"; 
			ИначеЕсли КодВидадеятельности = 2 Тогда 
				СтрокаВД = "390";
			ИначеЕсли КодВидадеятельности = 5 Тогда 
				СтрокаВД = "410";
			КонецЕсли;	
			
			Если НЕ СтрокаРезультат.РезидентРФ  Тогда
				СтрокаНеРезидент = "360";
				СтрокаВД = "";
			КонецЕсли;	
			
		КонецЕсли;	
		
		Если Не ПустаяСтрока(СтрокаН) И Не ПустаяСтрока(СтрокаК) Тогда 
			ЗаполнитьСтроку(ОбластьРаздел, СтрокаН, СтрокаК, СтрокаРезультат, 1);
		КонецЕсли;
		Если Не ПустаяСтрока(СтрокаВД) Тогда 
			ЗаполнитьСтроку(ОбластьРаздел, СтрокаВД, СтрокаВД, СтрокаРезультат, 1);
		КонецЕсли;
		Если Не ПустаяСтрока(СтрокаНеРезидент) Тогда 
			ЗаполнитьСтроку(ОбластьРаздел, СтрокаНеРезидент, СтрокаНеРезидент, СтрокаРезультат, 1);
		КонецЕсли;	
		
		ДобавитьВРасшифровку(ДокументРасшифровка, ОбластьСтрока, СтрокаРезультат, СтатусНачало, СтатусКонец, СтрокаН, СтрокаК, СтрокаВД, СтрокаНеРезидент);	
	КонецЦикла;
	
	РасчетИтоговРаздел1(ОбластьРаздел);
	ДокументРаздел1.Вывести(ОбластьРаздел);
	
КонецПроцедуры	

Процедура ЗаполнитьРаздел2(ДокументРаздел2, Расшифровка)
	
	Макет = ПолучитьМакет("МакетРаздел2");
	ОбластьРаздел = Макет.ПолучитьОбласть("Раздел2");
	
	//заполнение показателей
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК Субконто1,
	|	СУММА(БухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокКт) КАК _01,
	|	СУММА(БухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокКт) КАК _06,
	|	СУММА(БухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт) КАК _03,
	|	СУММА(ВЫБОР
	|			КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.КраткосрочныеКредиты)
	|				ТОГДА БухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК _02,
	|	СУММА(ВЫБОР
	|			КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПроцентыПоКраткосрочнымКредитам)
	|				ТОГДА БухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК _04,
	|	СУММА(0) КАК _05
	|ИЗ
	|	РегистрБухгалтерии.БухгалтерскийУчет.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыПоКраткосрочнымКредитамИЗаймам)),
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	БухгалтерскийУчетОстаткиИОбороты.Субконто1";
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("НачалоПериода", ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.Период.ДатаОкончания);
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();

	//распределение
	Для Каждого СтрокаРезультат из ТаблицаЗапроса Цикл 
		СтрокаН = "570";  //	
		Если Не ПустаяСтрока(СтрокаН) Тогда 
			ЗаполнитьСтроку(ОбластьРаздел, СтрокаН, СтрокаН, СтрокаРезультат, 2);
		КонецЕсли;	
	КонецЦикла;
	
	РасчетИтоговРаздел2(ОбластьРаздел);
	ДокументРаздел2.Вывести(ОбластьРаздел);
	
КонецПроцедуры	

Процедура ЗаполнитьРаздел3(ДокументРаздел3, Расшифровка)
	
	Макет = ПолучитьМакет("МакетРаздел3");
	ОбластьРаздел = Макет.ПолучитьОбласть("Раздел3");
	
	//заполнение показателей
	
	ДокументРаздел3.Вывести(ОбластьРаздел);
	
КонецПроцедуры	

Процедура Сформировать(ДокументТитул, ДокументРаздел1, ДокументРаздел2, ДокументРаздел3, Расшифровка) Экспорт
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".Сформировать()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления,Подписант");
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ДокументТитул.Очистить(); 
	ДокументРаздел1.Очистить(); 
	ДокументРаздел2.Очистить(); 
	ДокументРаздел3.Очистить(); 
	Расшифровка.Очистить();	
	
	ЗаполнитьТитульныйЛист(ДокументТитул);
	ЗаполнитьРаздел1(ДокументРаздел1, Расшифровка);
	ЗаполнитьРаздел2(ДокументРаздел2, Расшифровка);
	ЗаполнитьРаздел3(ДокументРаздел3, Расшифровка);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры
